{
    "basics": {
        "name": "Rodolfo Reis Soldati",
        "label": "Postdoctoral Researcher at the Institute for Quantum Computing",
        "image": "",
        "email": "rreissol@uwaterloo.ca",
        "summary": "",
        "location": {
            "address": "200 University Avenue West",
            "postalCode": "N2L 3G1",
            "city": "Waterloo",
            "countryCode": "CA",
            "region": "Ontario"
        },
        "profiles": [
            {
                "network": "Homepage",
                "url": "https://rodolfor-s.github.io/"
            }
        ]
    },
    "work": [
        {
            "name": "University of Stuttgart",
            "position": "Teaching Assistant",
            "startDate": "2020-01",
            "endDate": "2023-07",
            "summary": "",
            "highlights": [
                "Courses taught: Classical Mechanics, Electrodynamics, Mathematical Methods of Physics 1."
            ]
        },
        {
            "name": "University of São Paulo",
            "position": "Teaching Assistant",
            "startDate": "2020-01",
            "endDate": "2020-06",
            "summary": "",
            "highlights": [
                "Course taught: Physics 1, Classical Mechanics."
            ]
        }
    ],
    "education": [
        {
            "institution": "Universität Stuttgart",
            "url": "http://elib.uni-stuttgart.de/handle/11682/13720",
            "area": "Physics",
            "studyType": "Ph.D.",
            "startDate": "2019",
            "endDate": "2023",
            "score": "",
            "courses": [
                "Thesis: Quantum cooling: thermodynamics and information."
            ]
        },
        {
            "institution": "Universidade de São Paulo",
            "url": "",
            "area": "Physics",
            "studyType": "Ph.D.",
            "startDate": "2019",
            "endDate": "2023",
            "score": "",
            "courses": [
                "Thesis: Quantum cooling: thermodynamics and information."
            ]
        },
        {
            "institution": "Universidade Federal de Minas Gerais",
            "url": "",
            "area": "Physics",
            "studyType": "M.Sc.",
            "startDate": "2017",
            "endDate": "2018",
            "score": "",
            "courses": [
                "Dissertation: Entanglement entropy in quantum field theory."
            ]
        },
        {
            "institution": "Universidade Federal de Minas Gerais",
            "url": "",
            "area": "Physics",
            "studyType": "B.Sc.",
            "startDate": "2013",
            "endDate": "2016",
            "score": "",
            "courses": []
        },
        {
            "institution": "Durham University",
            "url": "",
            "area": "Theoretical Physics",
            "studyType": "Visiting Student",
            "startDate": "2014",
            "endDate": "2015",
            "score": "",
            "courses": [
                "Awarded with the Science Without Borders scholarship."
            ]
        }
    ],
    "projects": [
        {
            "name": "Quantum Discussions Seminar Series",
            "description": "Organized seminars at USP focusing on the interface between quantum information, condensed matter, and high-energy physics.",
            "highlights": [],
            "keywords": [
                "Seminar",
                "Quantum Information",
                "Condensed Matter Physics",
                "High-energy physics"
            ],
            "startDate": "2019",
            "endDate": "2019",
            "url": "http://quantumdiscussions.if.usp.br/"
        }
    ],
    "publications": [
        {
            "name": "Poisson's Spot and Gouy Phase",
            "publisher": "Phys. Rev. A",
            "releaseDate": "2016-12",
            "url": "https://arxiv.org/abs/1609.09023",
            "summary": "Recently there have been experimental results on Poisson spot matter wave interferometry followed by theoretical models describing the relative importance of the wave and particle behaviors for the phenomenon. We propose an analytical theoretical model for the Poisson's spot with matter waves based on Babinet principle in which we use the results for a free propagation and single slit diffraction. We take into account effects of loss of coherence and finite detection area using the propagator for a quantum particle interacting with an environment. We observe that the matter wave Gouy phase plays a role in the existence of the central peak and thus corroborates the predominantly wavelike character of the Poisson's spot. Our model shows remarkable agreement with the experimental data for deuterium D₂ molecules."
          },
          {
            "name": "Cooling Limits of Coherent Refrigerators",
            "publisher": "arXiv",
            "releaseDate": "2024-10",
            "url": "https://arxiv.org/abs/2410.18201",
            "summary": "Refrigeration limits are of fundamental and practical importance. We here show that quantum systems can be cooled below existing incoherent cooling bounds by employing coherent virtual qubits, even if the amount of coherence is incompletely known. Virtual subsystems, that do not necessarily correspond to a natural eigensubspace of a system, are a key conceptual tool in quantum information science and quantum thermodynamics. We derive universal coherent cooling limits and introduce specific protocols to reach them. As an illustration, we propose a generalized algorithmic cooling protocol that outperforms its current incoherent counterpart. Our results provide a general framework to investigate the performance of coherent refrigeration processes."
          },
          {
            "name": "Multipartite Quantum Correlations in a Two-Mode Dicke Model",
            "publisher": "Phys. Rev. A",
            "releaseDate": "2021-11",
            "url": "https://arxiv.org/abs/2105.09260",
            "summary": "We analyze multipartite correlations in a generalized Dicke model involving two optical modes interacting with an ensemble of two-level atoms. In particular, we examine correlations beyond the standard bipartite entanglement and derive exact results in the thermodynamic limit. The model presents two superradiant phases involving the spontaneous breaking of either a Z₂ or U(1) symmetry. The latter is characterized by the emergence of a Goldstone excitation, found to significantly affect the correlation profiles. Focusing on the correlations between macroscopic subsystems, we analyze both the mutual information as well as the entanglement of formation for all possible bipartitions among the optical and matter degrees of freedom. It is found that while each mode entangles with the atoms, the bipartite entanglement between the modes is zero, and they share only classical correlations and quantum discord. We also study the monogamy of multipartite entanglement and show that there exists genuine tripartite entanglement, i.e., quantum correlations that the atoms share with the two modes but not with them individually, only in the vicinity of the critical lines."
          },
          {
            "name": "[Thesis] Quantum Cooling: Thermodynamics and Information",
            "publisher": "Universität Stuttgart",
            "releaseDate": "2023",
            "url": "http://dx.doi.org/10.18419/opus-13701",
            "summary": "The theory of cooling is an important corner of thermodynamics, underlying many modern technological applications. As the field of quantum thermodynamics advances, refrigeration techniques must keep pace to fuel the innovations of quantum technologies. We study quantum cooling from its foundations to laboratory implementations within the specific paradigm of heat bath algorithmic cooling. Our study includes detailed modeling of experimental imperfections and establishes the fundamental cooling limits of the model, consolidating the algorithm as a viable quantum refrigeration method. Next, by developing the notion of virtual qubits, we demonstrate a cooling-boost protocol fueled by quantum coherences which is robust to experimental implementations. Aiming at aiding in the progress of refrigeration technologies, we conclude by studying the zero-temperature equilibrium properties of a many-body system that can accommodate an autonomous quantum absorption refrigerator, and calculate its entanglement and critical properties, two features that, like quantum coherences, promise to improve the performance of quantum coolers."
          },
          {
            "name": "Thermodynamics of a Minimal Algorithmic Cooling Refrigerator",
            "publisher": "Phys. Rev. Lett.",
            "releaseDate": "2022-07",
            "url": "https://arxiv.org/abs/2109.14056",
            "summary": "We investigate, theoretically and experimentally, the thermodynamic performance of a minimal three-qubit heat-bath algorithmic cooling refrigerator. We analytically compute the coefficient of performance, the cooling power, and the polarization of the target qubit for an arbitrary number of cycles, taking realistic experimental imperfections into account. We determine their fundamental upper bounds in the ideal reversible limit and show that these values may be experimentally approached using a system of three qubits in a nitrogen-vacancy center in diamond."
          },
          {
            "name": "Universal Terms of the Entanglement Entropy in a Static Closed Universe",
            "publisher": "Phys. Rev. D",
            "releaseDate": "2021-12",
            "url": "https://arxiv.org/abs/2106.06803",
            "summary": "Subdominant contributions to the entanglement entropy of quantum fields include logarithmic corrections to the area law characterized by universal coefficients that are independent of the ultraviolet regulator and capture detailed information on the geometry around the entangling surface. We determine two universal coefficients of the entanglement entropy for a massive scalar field in a static closed universe R × S³ perturbatively and verify the results numerically. The first coefficient describes a well-known generic correction to the area law independent of the geometry of the entangling surface and background. The second coefficient describes a curvature-dependent universal term with a nontrivial dependence on the intrinsic and extrinsic geometries of the entangling surface and curvature of the background. The numerical calculations confirm the analytical results to high accuracy. The first and second universal coefficients are determined numerically with a relative error with respect to the analytical values of the orders 10⁻⁴ and 10⁻², respectively."
          }
    ],
    "skills": [
        {
            "name": "Physics",
            "keywords": [
                "Quantum Thermodynamics",
                "Quantum Information",
                "Relativistic Quantum Information"
            ]
        }
    ],
    "languages": [
        {
            "language": "Portuguese",
            "fluency": "Native"
        },
        {
            "language": "English",
            "fluency": "Fluent"
        }
    ]
}
